# Используйте официальный образ Node.js в качестве базового образа
FROM node:18

# Установите рабочую директорию внутри контейнера
WORKDIR /app

# Скопируйте файлы package.json и package-lock.json в контейнер
COPY package*.json ./

# Установите зависимости
RUN npm install

# Скопируйте все файлы из текущего каталога в контейнер
COPY . .

# Соберите приложение React
RUN npm run build

# Установите сервер для статических файлов
RUN npm install -g serve

# Задайте команду для запуска приложения React
CMD serve -s build

# Определите порт, на котором будет работать приложение
EXPOSE 3000